# ConvertToUnstyledWall

## Description
Sets a wall to be unstyled.

```pascal
FUNCTION ConvertToUnstyledWall(h : HANDLE) : BOOLEAN;
```

```python

def vs.ConvertToUnstyledWall(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||

## Remarks
Sets a wall to be unstyled. This allows a wall to then be manipulated by certain functions that will not work on a styled wall.

## Version
Availability: from VectorWorks12.0
## Category
* Objects - Walls